# StairOnlyOneConnectedBoundary Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..StairOnlyOneConnectedBoundary Property
BuiltInFailures..::..SketchFailures Class See Also
---
Stairs require no less than two boundaries (chains of one or more Boundary Lines)."
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StairOnlyOneConnectedBoundary { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairOnlyOneConnectedBoundary As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StairOnlyOneConnectedBoundary {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace